SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/EFR32SG23/Include/efr32sg23_usart.h
/* Bit fields for USART TIMECMP1 */
#define _USART_TIMECMP1_RESETVALUE              0x00000000UL                            /**< Default value for USART_TIMECMP1            */
#define _USART_TIMECMP1_MASK                    0x017700FFUL                            /**< Mask for USART_TIMECMP1                     */
#define _USART_TIMECMP1_TCMPVAL_SHIFT           0                                       /**< Shift value for USART_TCMPVAL               */
#define _USART_TIMECMP1_TCMPVAL_MASK            0xFFUL                                  /**< Bit mask for USART_TCMPVAL                  */
#define _USART_TIMECMP1_TCMPVAL_DEFAULT         0x00000000UL                            /**< Mode DEFAULT for USART_TIMECMP1             */
#define USART_TIMECMP1_TCMPVAL_DEFAULT          (_USART_TIMECMP1_TCMPVAL_DEFAULT << 0)  /**< Shifted mode DEFAULT for USART_TIMECMP1     */
#define _USART_TIMECMP1_TSTART_SHIFT            16                                      /**< Shift value for USART_TSTART                */
#define _USART_TIMECMP1_TSTART_MASK             0x70000UL                               /**< Bit mask for USART_TSTART                   */
#define _USART_TIMECMP1_TSTART_DEFAULT          0x00000000UL                            /**< Mode DEFAULT for USART_TIMECMP1             */
#define _USART_TIMECMP1_TSTART_DISABLE          0x00000000UL                            /**< Mode DISABLE for USART_TIMECMP1             */
#define _USART_TIMECMP1_TSTART_TXEOF            0x00000001UL                            /**< Mode TXEOF for USART_TIMECMP1               */
#define _USART_TIMECMP1_TSTART_TXC              0x00000002UL                            /**< Mode TXC for USART_TIMECMP1                 */
#define _USART_TIMECMP1_TSTART_RXACT            0x00000003UL                            /**< Mode RXACT for USART_TIMECMP1               */
#define _USART_TIMECMP1_TSTART_RXEOF            0x00000004UL                            /**< Mode RXEOF for USART_TIMECMP1               */
#define USART_TIMECMP1_TSTART_DEFAULT           (_USART_TIMECMP1_TSTART_DEFAULT << 16)  /**< Shifted mode DEFAULT for USART_TIMECMP1     */
#define USART_TIMECMP1_TSTART_DISABLE           (_USART_TIMECMP1_TSTART_DISABLE << 16)  /**< Shifted mode DISABLE for USART_TIMECMP1     */
#define USART_TIMECMP1_TSTART_TXEOF             (_USART_TIMECMP1_TSTART_TXEOF << 16)    /**< Shifted mode TXEOF for USART_TIMECMP1       */
#define USART_TIMECMP1_TSTART_TXC               (_USART_TIMECMP1_TSTART_TXC << 16)      /**< Shifted mode TXC for USART_TIMECMP1         */
#define USART_TIMECMP1_TSTART_RXACT             (_USART_TIMECMP1_TSTART_RXACT << 16)    /**< Shifted mode RXACT for USART_TIMECMP1       */
#define USART_TIMECMP1_TSTART_RXEOF             (_USART_TIMECMP1_TSTART_RXEOF << 16)    /**< Shifted mode RXEOF for USART_TIMECMP1       */
#define _USART_TIMECMP1_TSTOP_SHIFT             20                                      /**< Shift value for USART_TSTOP                 */
#define _USART_TIMECMP1_TSTOP_MASK              0x700000UL                              /**< Bit mask for USART_TSTOP                    */
#define _USART_TIMECMP1_TSTOP_DEFAULT           0x00000000UL                            /**< Mode DEFAULT for USART_TIMECMP1             */
#define _USART_TIMECMP1_TSTOP_TCMP1             0x00000000UL                            /**< Mode TCMP1 for USART_TIMECMP1               */
#define _USART_TIMECMP1_TSTOP_TXST              0x00000001UL                            /**< Mode TXST for USART_TIMECMP1                */
#define _USART_TIMECMP1_TSTOP_RXACT             0x00000002UL                            /**< Mode RXACT for USART_TIMECMP1               */
#define _USART_TIMECMP1_TSTOP_RXACTN            0x00000003UL                            /**< Mode RXACTN for USART_TIMECMP1              */
#define USART_TIMECMP1_TSTOP_DEFAULT            (_USART_TIMECMP1_TSTOP_DEFAULT << 20)   /**< Shifted mode DEFAULT for USART_TIMECMP1     */
#define USART_TIMECMP1_TSTOP_TCMP1              (_USART_TIMECMP1_TSTOP_TCMP1 << 20)     /**< Shifted mode TCMP1 for USART_TIMECMP1       */
#define USART_TIMECMP1_TSTOP_TXST               (_USART_TIMECMP1_TSTOP_TXST << 20)      /**< Shifted mode TXST for USART_TIMECMP1        */
#define USART_TIMECMP1_TSTOP_RXACT              (_USART_TIMECMP1_TSTOP_RXACT << 20)     /**< Shifted mode RXACT for USART_TIMECMP1       */
#define USART_TIMECMP1_TSTOP_RXACTN             (_USART_TIMECMP1_TSTOP_RXACTN << 20)    /**< Shifted mode RXACTN for USART_TIMECMP1      */
#define USART_TIMECMP1_RESTARTEN                (0x1UL << 24)                           /**< Restart Timer on TCMP1                      */
#define _USART_TIMECMP1_RESTARTEN_SHIFT         24                                      /**< Shift value for USART_RESTARTEN             */
#define _USART_TIMECMP1_RESTARTEN_MASK          0x1000000UL                             /**< Bit mask for USART_RESTARTEN                */
#define _USART_TIMECMP1_RESTARTEN_DEFAULT       0x00000000UL                            /**< Mode DEFAULT for USART_TIMECMP1             */
#define _USART_TIMECMP1_RESTARTEN_DISABLE       0x00000000UL                            /**< Mode DISABLE for USART_TIMECMP1             */
#define _USART_TIMECMP1_RESTARTEN_ENABLE        0x00000001UL                            /**< Mode ENABLE for USART_TIMECMP1              */
#define USART_TIMECMP1_RESTARTEN_DEFAULT        (_USART_TIMECMP1_RESTARTEN_DEFAULT << 24) /**< Shifted mode DEFAULT for USART_TIMECMP1     */
#define USART_TIMECMP1_RESTARTEN_DISABLE        (_USART_TIMECMP1_RESTARTEN_DISABLE << 24) /**< Shifted mode DISABLE for USART_TIMECMP1     */
#define USART_TIMECMP1_RESTARTEN_ENABLE         (_USART_TIMECMP1_RESTARTEN_ENABLE << 24) /**< Shifted mode ENABLE for USART_TIMECMP1      */

/* Bit fields for USART TIMECMP2 */
#define _USART_TIMECMP2_RESETVALUE              0x00000000UL                            /**< Default value for USART_TIMECMP2            */
#define _USART_TIMECMP2_MASK                    0x017700FFUL                            /**< Mask for USART_TIMECMP2                     */
#define _USART_TIMECMP2_TCMPVAL_SHIFT           0                                       /**< Shift value for USART_TCMPVAL               */
#define _USART_TIMECMP2_TCMPVAL_MASK            0xFFUL                                  /**< Bit mask for USART_TCMPVAL                  */
#define _USART_TIMECMP2_TCMPVAL_DEFAULT         0x00000000UL                            /**< Mode DEFAULT for USART_TIMECMP2             */
#define USART_TIMECMP2_TCMPVAL_DEFAULT          (_USART_TIMECMP2_TCMPVAL_DEFAULT << 0)  /**< Shifted mode DEFAULT for USART_TIMECMP2     */
#define _USART_TIMECMP2_TSTART_SHIFT            16                                      /**< Shift value for USART_TSTART                */
#define _USART_TIMECMP2_TSTART_MASK             0x70000UL                               /**< Bit mask for USART_TSTART                   */
#define _USART_TIMECMP2_TSTART_DEFAULT          0x00000000UL                            /**< Mode DEFAULT for USART_TIMECMP2             */
#define _USART_TIMECMP2_TSTART_DISABLE          0x00000000UL                            /**< Mode DISABLE for USART_TIMECMP2             */
#define _USART_TIMECMP2_TSTART_TXEOF            0x00000001UL                            /**< Mode TXEOF for USART_TIMECMP2               */
#define _USART_TIMECMP2_TSTART_TXC              0x00000002UL                            /**< Mode TXC for USART_TIMECMP2                 */
#define _USART_TIMECMP2_TSTART_RXACT            0x00000003UL                            /**< Mode RXACT for USART_TIMECMP2               */
#define _USART_TIMECMP2_TSTART_RXEOF            0x00000004UL                            /**< Mode RXEOF for USART_TIMECMP2               */
#define USART_TIMECMP2_TSTART_DEFAULT           (_USART_TIMECMP2_TSTART_DEFAULT << 16)  /**< Shifted mode DEFAULT for USART_TIMECMP2     */
#define USART_TIMECMP2_TSTART_DISABLE           (_USART_TIMECMP2_TSTART_DISABLE << 16)  /**< Shifted mode DISABLE for USART_TIMECMP2     */
#define USART_TIMECMP2_TSTART_TXEOF             (_USART_TIMECMP2_TSTART_TXEOF << 16)    /**< Shifted mode TXEOF for USART_TIMECMP2       */
#define USART_TIMECMP2_TSTART_TXC               (_USART_TIMECMP2_TSTART_TXC << 16)      /**< Shifted mode TXC for USART_TIMECMP2         */
#define USART_TIMECMP2_TSTART_RXACT             (_USART_TIMECMP2_TSTART_RXACT << 16)    /**< Shifted mode RXACT for USART_TIMECMP2       */
#define USART_TIMECMP2_TSTART_RXEOF             (_USART_TIMECMP2_TSTART_RXEOF << 16)    /**< Shifted mode RXEOF for USART_TIMECMP2       */
#define _USART_TIMECMP2_TSTOP_SHIFT             20                                      /**< Shift value for USART_TSTOP                 */
#define _USART_TIMECMP2_TSTOP_MASK              0x700000UL                              /**< Bit mask for USART_TSTOP                    */
#define _USART_TIMECMP2_TSTOP_DEFAULT           0x00000000UL                            /**< Mode DEFAULT for USART_TIMECMP2             */
#define _USART_TIMECMP2_TSTOP_TCMP2             0x00000000UL                            /**< Mode TCMP2 for USART_TIMECMP2               */
#define _USART_TIMECMP2_TSTOP_TXST              0x00000001UL                            /**< Mode TXST for USART_TIMECMP2                */
#define _USART_TIMECMP2_TSTOP_RXACT             0x00000002UL                            /**< Mode RXACT for USART_TIMECMP2               */
#define _USART_TIMECMP2_TSTOP_RXACTN            0x00000003UL                            /**< Mode RXACTN for USART_TIMECMP2              */
#define USART_TIMECMP2_TSTOP_DEFAULT            (_USART_TIMECMP2_TSTOP_DEFAULT << 20)   /**< Shifted mode DEFAULT for USART_TIMECMP2     */
#define USART_TIMECMP2_TSTOP_TCMP2              (_USART_TIMECMP2_TSTOP_TCMP2 << 20)     /**< Shifted mode TCMP2 for USART_TIMECMP2       */
#define USART_TIMECMP2_TSTOP_TXST               (_USART_TIMECMP2_TSTOP_TXST << 20)      /**< Shifted mode TXST for USART_TIMECMP2        */
#define USART_TIMECMP2_TSTOP_RXACT              (_USART_TIMECMP2_TSTOP_RXACT << 20)     /**< Shifted mode RXACT for USART_TIMECMP2       */
#define USART_TIMECMP2_TSTOP_RXACTN             (_USART_TIMECMP2_TSTOP_RXACTN << 20)    /**< Shifted mode RXACTN for USART_TIMECMP2      */
#define USART_TIMECMP2_RESTARTEN                (0x1UL << 24)                           /**< Restart Timer on TCMP2                      */
#define _USART_TIMECMP2_RESTARTEN_SHIFT         24                                      /**< Shift value for USART_RESTARTEN             */
#define _USART_TIMECMP2_RESTARTEN_MASK          0x1000000UL                             /**< Bit mask for USART_RESTARTEN                */
#define _USART_TIMECMP2_RESTARTEN_DEFAULT       0x00000000UL                            /**< Mode DEFAULT for USART_TIMECMP2             */
#define _USART_TIMECMP2_RESTARTEN_DISABLE       0x00000000UL                            /**< Mode DISABLE for USART_TIMECMP2             */
#define _USART_TIMECMP2_RESTARTEN_ENABLE        0x00000001UL                            /**< Mode ENABLE for USART_TIMECMP2              */
#define USART_TIMECMP2_RESTARTEN_DEFAULT        (_USART_TIMECMP2_RESTARTEN_DEFAULT << 24) /**< Shifted mode DEFAULT for USART_TIMECMP2     */
#define USART_TIMECMP2_RESTARTEN_DISABLE        (_USART_TIMECMP2_RESTARTEN_DISABLE << 24) /**< Shifted mode DISABLE for USART_TIMECMP2     */
#define USART_TIMECMP2_RESTARTEN_ENABLE         (_USART_TIMECMP2_RESTARTEN_ENABLE << 24) /**< Shifted mode ENABLE for USART_TIMECMP2      */

/** @} End of group EFR32SG23_USART_BitFields */
/** @} End of group EFR32SG23_USART */
/** @} End of group Parts */

#endif // EFR32SG23_USART_H
